[
  {
    "url": "https://www.bebeautiful.in/all-things-makeup/trending/beauty-trends-lakme-fashion-week-2024",
    "content": "# 7 Beauty Trends as Seen on The Lakmé Fashion Week Runway 2024\n\n*This season is all about playful yet fierce eye looks, really cute hair accessories and unleashing your creative genius*\n\n> Home > Makeup > Trending\n\n**Author:** Praneet Sahni Kalani\n**Date:** 11 Oct ‘24\n\n![7 Beauty Trends from Lakme Fashion Week 2024 Runway](https://img.bebeautiful.in/www-bebeautiful-in/2024-10/7-beauty-trends%20from-lakme-fashion-week-2024-runway_0.png)\n\n**Tags:** Runway-inspired beauty tips, Lakmé Fashion Week makeup looks, Runway beauty trends 2024, Statement eye looks, Braided hair, Temporary Tattoos, Sheer Base, Dark Lips, 90s Glamour\n\n## Keep reading to know...\n\n\n\nIf backstage is beauty school, then we’re all eager students twice each year. We’ve been diligently studying this season’s makeup and hair trends from Lakme Fashion Week 2024. Bold eyes, dark lips, sheer base and a strong hair game – the Spring/Summer 2025 season delivered some standout beauty moments. Leaning into a little bit of 90s nostalgia, coupled with temporary tattoos and head-turning braids, it’s all about getting back in touch with your inner child. Experiment with textures, colours and hair accessories, with a hint of fierceness that’s still playful. Here are seven beauty looks we’re loving from Lakme Fashion Week 2024.\n\n\n\n## Bold Eyes\n\nWe don’t just mean a liner and kohl eyes; it’s about really going all out this season. Designers on the runway drew attention to the eyes, ‘the window to our soul’, with fierce eye makeup. <a href=\"https://www.bebeautiful.in/all-things-makeup/eyes/ultimate-guide-to-smokey-eyes-look\" target=\"_blank\">Smokey eyes</a>, heavy graphic liners and even electrifying the eyes with sparkles and glitter dominated the looks. As seen at the Péro show on the opening night, the artists took it up a notch with temporary tattoos as eyeshadow. We believe the more creative, the better. Others opted for chrome eyes, smudged eyes, slim rimmed looks and frosted eye shadow too.\n\n![](https://img.bebeautiful.in/www-bebeautiful-in/2024-10/Pero-Bold%20eyes.png)\n\n**Key takeaway; Don’t shy away**. Create your desired eyes with **Lakme Absolute Explore Eye Paint** that comes in many shades and is ideal to perfect your glam face.\n\n## Braid Upgrade\n\nLevel up the simple beauty staple with braided buns, pigtails, and French braids. Add hair accessories like hair bows, ribbons, clips, and scarves and don’t stop at just one. Channel maximalism when it comes to hair props and even braids this season. On day 1 &amp; 2, both Indian design houses Péro and Payal Pratap made a strong case for this chic hair game\n\n![](https://img.bebeautiful.in/www-bebeautiful-in/2024-10/Braids%20-%20payal%20pratap.png)\n\n## 90’s Glamour\n\nBring on the glitter on your eyes with chrome eyes. From Sameer Madan, to Payal Pratap, it was all about frosted eyelids. Add a lacquered lip gloss and you’re ready for your 90s moment. Reminiscent of the ‘more is more’ era, it’s sophisticated and impactful with vibrant colours and dazzling shimmer, with a hint of fresh-face simplicity. Put your glam face on with a host of **Lakme eyeshadow palettes.**\n\n## Temporary Tattoos\n\nForgot your necklace at home? Commitment issues? Indecisive? No worries. Temporary tattoos are turning eyeballs this season. Just like Péro’s big fashion party that inspired us to get creative and handsy with Hello Kitty tattoos, you can turn to stickers and stamps to add your own personality to your outfit.\n\n![](https://img.bebeautiful.in/www-bebeautiful-in/2024-10/Temp%20tats%20hello%20kitty.png)\n\n## Sheer Base\n\nMake way for barely there finish. The ‘no-makeup’ look is here to stay. Veil dark circles and spots first and then move to foundation or do it the other way round – what works for you, works for you. Some days I get away with just a concealer. I love the **Lakme Superglow Concealer** which is a brightening concealer with vitamin C complex and glycerin. It keeps the skin hydrated and radiant. Top it with any lightweight **Lakme foundation.**\n\n![](https://img.bebeautiful.in/www-bebeautiful-in/2024-10/Sheer%20base%20makeup.png)\n\n## Slick Back Hair\n\nKeep it wet, keep it neat, keep it sleek – whatever you do, keep it slick. **Tresemme’s hair care range and styling products** will help you get there. Keep those flyaway strands at bay without letting them throw off your whole vibe with **<a href=\"https://www.tresemme.in/products/tresemme-keratin-smooth-hair-serum\" target=\"_blank\">Tresemme Keratin Smooth Serum</a>.**\n\n![](https://img.bebeautiful.in/www-bebeautiful-in/2024-10/Slick%20back%20hair.png)\n\nWith a plethora of noteworthy viral moments intermixed with an air of carefree creativity, get on top of these beauty trends and hacks of the season.\n\n---\n\n### About the Author\n\n![Praneet Sahni Kalani](https://img.bebeautiful.in/www-bebeautiful-in/praneet-kalani.png)\n\nPraneet Sahni KalaniPraneet Sahni Kalani is a fashion & lifestyle writer. Find her near cream cheese dimsums and obsessing over hair care.\n\n### Related Articles\n\n- [Valentine Gift Ideas for Every Type of Partner](/all-things-makeup/trending/valentine-gift-ideas-for-every-partner) - By Team BB (12 Feb ‘25)\n- [What’s Hot & What’s Not: Decoding 2025’s Biggest Beauty Trends](/all-things-makeup/trending/beauty-trends-2025) - By Nidhi Kavle (26 Jan ‘25)\n- [Lakmé’s latest launch—the Rouge Bloom collection invites you to slow down and embrace your beauty routine](/all-things-makeup/trending/lakme-rouge-bloom-launch) - By Pallavi Mehra (11 Oct ‘24)\n"
  }
]